SAVDO/src/DataProcessors/УстановитьИспользуетсяДляНоменклатуры/УстановитьИспользуетсяДляНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановитьИспользуетсяДляНоменклатуры</name>
</mdclass:DataProcessor>

SAVDO/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>УдалитьСправочник_ВнешниеПользователи</name>
      <description>Внешние пользователи</description>
    </items>
    <items>
      <name>УдалитьДокумент_Встреча</name>
      <description>Встреча</description>
    </items>
    <items>
      <name>УдалитьДокумент_ЗапланированноеВзаимодействие</name>
      <description>Запланированное взаимодействие</description>
    </items>
    <items>
      <name>УдалитьСправочник_ПапкиФайлов</name>
      <description>Папка</description>
    </items>
    <items>
      <name>УдалитьСправочник_Пользователи</name>
      <description>Пользователи</description>
    </items>
    <items>
      <name>УдалитьДокумент_СообщениеSMS</name>
      <description>Сообщение SMS</description>
    </items>
    <items>
      <name>УдалитьДокумент_ТелефонныйЗвонок</name>
      <description>Телефонный звонок</description>
    </items>
    <items>
      <name>УдалитьСправочник_Файлы</name>
      <description>Файл</description>
    </items>
    <items>
      <name>УдалитьДокумент_ЭлектронноеПисьмоВходящее</name>
      <description>Электронное письмо входящее</description>
    </items>
    <items>
      <name>УдалитьДокумент_ЭлектронноеПисьмоИсходящее</name>
      <description>Электронное письмо исходящее</description>
    </items>
    <items>
      <name>Справочник_Номенклатура</name>
      <description>Номенклатура</description>
    </items>
  </predefined>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСведений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМеток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредопределенногоНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСведения</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредопределенногоНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SAVDO/src/DataProcessors/УстановитьИспользуетсяДляНоменклатуры/Forms/Форма/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Обработка для установки реквизита Используется = Истина для предопределенного элемента
// Справочник_Номенклатура в справочнике НаборыДополнительныхРеквизитовИСведений
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнить(Команда)
	
	ВыполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере()
	
	Попытка
		
		НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура;
		
		Если НаборСвойств.Пустая() Тогда
			ВызватьИсключение "Предопределенный элемент Справочник_Номенклатура не найден! Сначала обновите конфигурацию базы данных.";
		КонецЕсли;
		
		ОбъектНабора = НаборСвойств.ПолучитьОбъект();
		
		Если ОбъектНабора = Неопределено Тогда
			ВызватьИсключение "Не удалось получить объект предопределенного элемента!";
		КонецЕсли;
		
		ОбъектНабора.Используется = Истина;
		ОбъектНабора.Записать();
		
		Сообщить("Реквизит Используется успешно установлен в значение Истина для предопределенного элемента Справочник_Номенклатура");
		
	Исключение
		
		Сообщить("Ошибка: " + ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры
